MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cx_sg1/thirdparty/pic32cx_sg1/component/cct.h
/*
 * Component description for CCT
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2020-03-24T11:15:30Z */
#ifndef _0525SG12_CCT_COMPONENT_H_
#define _0525SG12_CCT_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR CCT                                          */
/* ************************************************************************** */

/* -------- CCT_CTRL : (CCT Offset: 0x00) (R/W 32) This register controls the capture and compare timer. -------- */
#define CCT_CTRL_RESETVALUE                   _UINT32_(0x3030000)                                  /*  (CCT_CTRL) This register controls the capture and compare timer.  Reset Value */

#define CCT_CTRL_ACT_Pos                      _UINT32_(0)                                          /* (CCT_CTRL) This bit is used to start the capture and compare timer running and power it down. Position */
#define CCT_CTRL_ACT_Msk                      (_UINT32_(0x1) << CCT_CTRL_ACT_Pos)                  /* (CCT_CTRL) This bit is used to start the capture and compare timer running and power it down. Mask */
#define CCT_CTRL_ACT(value)                   (CCT_CTRL_ACT_Msk & (_UINT32_(value) << CCT_CTRL_ACT_Pos)) /* Assigment of value for ACT in the CCT_CTRL register */
#define CCT_CTRL_FREE_EN_Pos                  _UINT32_(1)                                          /* (CCT_CTRL) Free-Running Timer Enable. This bit is used to start and stop the free running timer. Position */
#define CCT_CTRL_FREE_EN_Msk                  (_UINT32_(0x1) << CCT_CTRL_FREE_EN_Pos)              /* (CCT_CTRL) Free-Running Timer Enable. This bit is used to start and stop the free running timer. Mask */
#define CCT_CTRL_FREE_EN(value)               (CCT_CTRL_FREE_EN_Msk & (_UINT32_(value) << CCT_CTRL_FREE_EN_Pos)) /* Assigment of value for FREE_EN in the CCT_CTRL register */
#define CCT_CTRL_FREE_RST_Pos                 _UINT32_(2)                                          /* (CCT_CTRL) Free Running Timer Reset. This bit stops the timer and resets the internal counter to 0000_0000h. Position */
#define CCT_CTRL_FREE_RST_Msk                 (_UINT32_(0x1) << CCT_CTRL_FREE_RST_Pos)             /* (CCT_CTRL) Free Running Timer Reset. This bit stops the timer and resets the internal counter to 0000_0000h. Mask */
#define CCT_CTRL_FREE_RST(value)              (CCT_CTRL_FREE_RST_Msk & (_UINT32_(value) << CCT_CTRL_FREE_RST_Pos)) /* Assigment of value for FREE_RST in the CCT_CTRL register */
#define CCT_CTRL_TCLK_Pos                     _UINT32_(4)                                          /* (CCT_CTRL) This 3-bit field sets the clock source for the Free-Running Counter. Position */
#define CCT_CTRL_TCLK_Msk                     (_UINT32_(0x7) << CCT_CTRL_TCLK_Pos)                 /* (CCT_CTRL) This 3-bit field sets the clock source for the Free-Running Counter. Mask */
#define CCT_CTRL_TCLK(value)                  (CCT_CTRL_TCLK_Msk & (_UINT32_(value) << CCT_CTRL_TCLK_Pos)) /* Assigment of value for TCLK in the CCT_CTRL register */
#define CCT_CTRL_CMP_EN0_Pos                  _UINT32_(8)                                          /* (CCT_CTRL) Compare Enable for Compare 0 Register. Position */
#define CCT_CTRL_CMP_EN0_Msk                  (_UINT32_(0x1) << CCT_CTRL_CMP_EN0_Pos)              /* (CCT_CTRL) Compare Enable for Compare 0 Register. Mask */
#define CCT_CTRL_CMP_EN0(value)               (CCT_CTRL_CMP_EN0_Msk & (_UINT32_(value) << CCT_CTRL_CMP_EN0_Pos)) /* Assigment of value for CMP_EN0 in the CCT_CTRL register */
#define CCT_CTRL_CMP_EN1_Pos                  _UINT32_(9)                                          /* (CCT_CTRL) Compare Enable for Compare 1 Register. Position */
#define CCT_CTRL_CMP_EN1_Msk                  (_UINT32_(0x1) << CCT_CTRL_CMP_EN1_Pos)              /* (CCT_CTRL) Compare Enable for Compare 1 Register. Mask */
#define CCT_CTRL_CMP_EN1(value)               (CCT_CTRL_CMP_EN1_Msk & (_UINT32_(value) << CCT_CTRL_CMP_EN1_Pos)) /* Assigment of value for CMP_EN1 in the CCT_CTRL register */
#define CCT_CTRL_CMP_SET1_Pos                 _UINT32_(16)                                         /* (CCT_CTRL) When read, returns the current value off the Compare Timer Output 1 state. Position */
#define CCT_CTRL_CMP_SET1_Msk                 (_UINT32_(0x1) << CCT_CTRL_CMP_SET1_Pos)             /* (CCT_CTRL) When read, returns the current value off the Compare Timer Output 1 state. Mask */
#define CCT_CTRL_CMP_SET1(value)              (CCT_CTRL_CMP_SET1_Msk & (_UINT32_(value) << CCT_CTRL_CMP_SET1_Pos)) /* Assigment of value for CMP_SET1 in the CCT_CTRL register */
#define CCT_CTRL_CMP_SET0_Pos                 _UINT32_(17)                                         /* (CCT_CTRL) When read, returns the current value off the Compare Timer Output 0 state. Position */
#define CCT_CTRL_CMP_SET0_Msk                 (_UINT32_(0x1) << CCT_CTRL_CMP_SET0_Pos)             /* (CCT_CTRL) When read, returns the current value off the Compare Timer Output 0 state. Mask */
#define CCT_CTRL_CMP_SET0(value)              (CCT_CTRL_CMP_SET0_Msk & (_UINT32_(value) << CCT_CTRL_CMP_SET0_Pos)) /* Assigment of value for CMP_SET0 in the CCT_CTRL register */
#define CCT_CTRL_CMP_CLR1_Pos                 _UINT32_(24)                                         /* (CCT_CTRL) When read, returns the current value off the Compare Timer Output 1 state. Position */
#define CCT_CTRL_CMP_CLR1_Msk                 (_UINT32_(0x1) << CCT_CTRL_CMP_CLR1_Pos)             /* (CCT_CTRL) When read, returns the current value off the Compare Timer Output 1 state. Mask */
#define CCT_CTRL_CMP_CLR1(value)              (CCT_CTRL_CMP_CLR1_Msk & (_UINT32_(value) << CCT_CTRL_CMP_CLR1_Pos)) /* Assigment of value for CMP_CLR1 in the CCT_CTRL register */
#define CCT_CTRL_CMP_CLR0_Pos                 _UINT32_(25)                                         /* (CCT_CTRL) When read, returns the current value off the Compare Timer Output 0 state. Position */
#define CCT_CTRL_CMP_CLR0_Msk                 (_UINT32_(0x1) << CCT_CTRL_CMP_CLR0_Pos)             /* (CCT_CTRL) When read, returns the current value off the Compare Timer Output 0 state. Mask */
#define CCT_CTRL_CMP_CLR0(value)              (CCT_CTRL_CMP_CLR0_Msk & (_UINT32_(value) << CCT_CTRL_CMP_CLR0_Pos)) /* Assigment of value for CMP_CLR0 in the CCT_CTRL register */
#define CCT_CTRL_Msk                          _UINT32_(0x03030377)                                 /* (CCT_CTRL) Register Mask  */

#define CCT_CTRL_CMP_EN_Pos                   _UINT32_(8)                                          /* (CCT_CTRL Position) Compare Enable for Compare x Register. */
#define CCT_CTRL_CMP_EN_Msk                   (_UINT32_(0x3) << CCT_CTRL_CMP_EN_Pos)               /* (CCT_CTRL Mask) CMP_EN */
#define CCT_CTRL_CMP_EN(value)                (CCT_CTRL_CMP_EN_Msk & (_UINT32_(value) << CCT_CTRL_CMP_EN_Pos)) 
#define CCT_CTRL_CMP_SET_Pos                  _UINT32_(16)                                         /* (CCT_CTRL Position) When read, returns the current value off the Compare Timer Output x state. */
#define CCT_CTRL_CMP_SET_Msk                  (_UINT32_(0x3) << CCT_CTRL_CMP_SET_Pos)              /* (CCT_CTRL Mask) CMP_SET */
#define CCT_CTRL_CMP_SET(value)               (CCT_CTRL_CMP_SET_Msk & (_UINT32_(value) << CCT_CTRL_CMP_SET_Pos)) 
#define CCT_CTRL_CMP_CLR_Pos                  _UINT32_(24)                                         /* (CCT_CTRL Position) When read, returns the current value off the Compare Timer Output x state. */
#define CCT_CTRL_CMP_CLR_Msk                  (_UINT32_(0x3) << CCT_CTRL_CMP_CLR_Pos)              /* (CCT_CTRL Mask) CMP_CLR */
#define CCT_CTRL_CMP_CLR(value)               (CCT_CTRL_CMP_CLR_Msk & (_UINT32_(value) << CCT_CTRL_CMP_CLR_Pos)) 

