MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cx_sg1/thirdparty/pic32cx_sg1/component/cct.h
/* -------- CCT_CAP0_CTRL : (CCT Offset: 0x04) (R/W 32) This register is used to configure capture and compare timers 0-3. -------- */
#define CCT_CAP0_CTRL_RESETVALUE              _UINT32_(0x00)                                       /*  (CCT_CAP0_CTRL) This register is used to configure capture and compare timers 0-3.  Reset Value */

#define CCT_CAP0_CTRL_CAP_EDGE0_Pos           _UINT32_(0)                                          /* (CCT_CAP0_CTRL) This field selects the edge type that triggers the capture of the Free Running Counter into Capture Register 0. Position */
#define CCT_CAP0_CTRL_CAP_EDGE0_Msk           (_UINT32_(0x3) << CCT_CAP0_CTRL_CAP_EDGE0_Pos)       /* (CCT_CAP0_CTRL) This field selects the edge type that triggers the capture of the Free Running Counter into Capture Register 0. Mask */
#define CCT_CAP0_CTRL_CAP_EDGE0(value)        (CCT_CAP0_CTRL_CAP_EDGE0_Msk & (_UINT32_(value) << CCT_CAP0_CTRL_CAP_EDGE0_Pos)) /* Assigment of value for CAP_EDGE0 in the CCT_CAP0_CTRL register */
#define CCT_CAP0_CTRL_FILTER_BYP0_Pos         _UINT32_(2)                                          /* (CCT_CAP0_CTRL) This bit enables bypassing the input noise filter for Capture Register 0, so that the input signal goes directly into the timer. Position */
#define CCT_CAP0_CTRL_FILTER_BYP0_Msk         (_UINT32_(0x1) << CCT_CAP0_CTRL_FILTER_BYP0_Pos)     /* (CCT_CAP0_CTRL) This bit enables bypassing the input noise filter for Capture Register 0, so that the input signal goes directly into the timer. Mask */
#define CCT_CAP0_CTRL_FILTER_BYP0(value)      (CCT_CAP0_CTRL_FILTER_BYP0_Msk & (_UINT32_(value) << CCT_CAP0_CTRL_FILTER_BYP0_Pos)) /* Assigment of value for FILTER_BYP0 in the CCT_CAP0_CTRL register */
#define CCT_CAP0_CTRL_FCLK_SEL0_Pos           _UINT32_(5)                                          /* (CCT_CAP0_CTRL) This 3-bit field sets the clock source for the input filter for Capture Register 0. Position */
#define CCT_CAP0_CTRL_FCLK_SEL0_Msk           (_UINT32_(0x7) << CCT_CAP0_CTRL_FCLK_SEL0_Pos)       /* (CCT_CAP0_CTRL) This 3-bit field sets the clock source for the input filter for Capture Register 0. Mask */
#define CCT_CAP0_CTRL_FCLK_SEL0(value)        (CCT_CAP0_CTRL_FCLK_SEL0_Msk & (_UINT32_(value) << CCT_CAP0_CTRL_FCLK_SEL0_Pos)) /* Assigment of value for FCLK_SEL0 in the CCT_CAP0_CTRL register */
#define CCT_CAP0_CTRL_CAP_EDGE1_Pos           _UINT32_(8)                                          /* (CCT_CAP0_CTRL) This field selects the edge type that triggers the capture of the Free Running Counter into Capture Register 1. Position */
#define CCT_CAP0_CTRL_CAP_EDGE1_Msk           (_UINT32_(0x3) << CCT_CAP0_CTRL_CAP_EDGE1_Pos)       /* (CCT_CAP0_CTRL) This field selects the edge type that triggers the capture of the Free Running Counter into Capture Register 1. Mask */
#define CCT_CAP0_CTRL_CAP_EDGE1(value)        (CCT_CAP0_CTRL_CAP_EDGE1_Msk & (_UINT32_(value) << CCT_CAP0_CTRL_CAP_EDGE1_Pos)) /* Assigment of value for CAP_EDGE1 in the CCT_CAP0_CTRL register */
#define CCT_CAP0_CTRL_FILTER_BYP1_Pos         _UINT32_(10)                                         /* (CCT_CAP0_CTRL) This bit enables bypassing the input noise filter for Capture Register 1, so that the input signal goes directly into the timer. Position */
#define CCT_CAP0_CTRL_FILTER_BYP1_Msk         (_UINT32_(0x1) << CCT_CAP0_CTRL_FILTER_BYP1_Pos)     /* (CCT_CAP0_CTRL) This bit enables bypassing the input noise filter for Capture Register 1, so that the input signal goes directly into the timer. Mask */
#define CCT_CAP0_CTRL_FILTER_BYP1(value)      (CCT_CAP0_CTRL_FILTER_BYP1_Msk & (_UINT32_(value) << CCT_CAP0_CTRL_FILTER_BYP1_Pos)) /* Assigment of value for FILTER_BYP1 in the CCT_CAP0_CTRL register */
#define CCT_CAP0_CTRL_FCLK_SEL1_Pos           _UINT32_(13)                                         /* (CCT_CAP0_CTRL) This 3-bit field sets the clock source for the input filter for Capture Register 1. Position */
#define CCT_CAP0_CTRL_FCLK_SEL1_Msk           (_UINT32_(0x7) << CCT_CAP0_CTRL_FCLK_SEL1_Pos)       /* (CCT_CAP0_CTRL) This 3-bit field sets the clock source for the input filter for Capture Register 1. Mask */
#define CCT_CAP0_CTRL_FCLK_SEL1(value)        (CCT_CAP0_CTRL_FCLK_SEL1_Msk & (_UINT32_(value) << CCT_CAP0_CTRL_FCLK_SEL1_Pos)) /* Assigment of value for FCLK_SEL1 in the CCT_CAP0_CTRL register */
#define CCT_CAP0_CTRL_CAP_EDGE2_Pos           _UINT32_(16)                                         /* (CCT_CAP0_CTRL) This field selects the edge type that triggers the capture of the Free Running Counter into Capture Register 2. Position */
#define CCT_CAP0_CTRL_CAP_EDGE2_Msk           (_UINT32_(0x3) << CCT_CAP0_CTRL_CAP_EDGE2_Pos)       /* (CCT_CAP0_CTRL) This field selects the edge type that triggers the capture of the Free Running Counter into Capture Register 2. Mask */
#define CCT_CAP0_CTRL_CAP_EDGE2(value)        (CCT_CAP0_CTRL_CAP_EDGE2_Msk & (_UINT32_(value) << CCT_CAP0_CTRL_CAP_EDGE2_Pos)) /* Assigment of value for CAP_EDGE2 in the CCT_CAP0_CTRL register */
#define CCT_CAP0_CTRL_FILTER_BYP2_Pos         _UINT32_(18)                                         /* (CCT_CAP0_CTRL) This bit enables bypassing the input noise filter for Capture Register 2, so that the input signal goes directly into the timer. Position */
#define CCT_CAP0_CTRL_FILTER_BYP2_Msk         (_UINT32_(0x1) << CCT_CAP0_CTRL_FILTER_BYP2_Pos)     /* (CCT_CAP0_CTRL) This bit enables bypassing the input noise filter for Capture Register 2, so that the input signal goes directly into the timer. Mask */
#define CCT_CAP0_CTRL_FILTER_BYP2(value)      (CCT_CAP0_CTRL_FILTER_BYP2_Msk & (_UINT32_(value) << CCT_CAP0_CTRL_FILTER_BYP2_Pos)) /* Assigment of value for FILTER_BYP2 in the CCT_CAP0_CTRL register */
#define CCT_CAP0_CTRL_FCLK_SEL2_Pos           _UINT32_(21)                                         /* (CCT_CAP0_CTRL) This 3-bit field sets the clock source for the input filter for Capture Register 2. Position */
#define CCT_CAP0_CTRL_FCLK_SEL2_Msk           (_UINT32_(0x7) << CCT_CAP0_CTRL_FCLK_SEL2_Pos)       /* (CCT_CAP0_CTRL) This 3-bit field sets the clock source for the input filter for Capture Register 2. Mask */
#define CCT_CAP0_CTRL_FCLK_SEL2(value)        (CCT_CAP0_CTRL_FCLK_SEL2_Msk & (_UINT32_(value) << CCT_CAP0_CTRL_FCLK_SEL2_Pos)) /* Assigment of value for FCLK_SEL2 in the CCT_CAP0_CTRL register */
#define CCT_CAP0_CTRL_CAP_EDGE3_Pos           _UINT32_(24)                                         /* (CCT_CAP0_CTRL) This field selects the edge type that triggers the capture of the Free Running Counter into Capture Register 3. Position */
#define CCT_CAP0_CTRL_CAP_EDGE3_Msk           (_UINT32_(0x3) << CCT_CAP0_CTRL_CAP_EDGE3_Pos)       /* (CCT_CAP0_CTRL) This field selects the edge type that triggers the capture of the Free Running Counter into Capture Register 3. Mask */
#define CCT_CAP0_CTRL_CAP_EDGE3(value)        (CCT_CAP0_CTRL_CAP_EDGE3_Msk & (_UINT32_(value) << CCT_CAP0_CTRL_CAP_EDGE3_Pos)) /* Assigment of value for CAP_EDGE3 in the CCT_CAP0_CTRL register */
#define CCT_CAP0_CTRL_FILTER_BYP3_Pos         _UINT32_(26)                                         /* (CCT_CAP0_CTRL) This bit enables bypassing the input noise filter for Capture Register 3, so that the input signal goes directly into the timer. Position */
#define CCT_CAP0_CTRL_FILTER_BYP3_Msk         (_UINT32_(0x1) << CCT_CAP0_CTRL_FILTER_BYP3_Pos)     /* (CCT_CAP0_CTRL) This bit enables bypassing the input noise filter for Capture Register 3, so that the input signal goes directly into the timer. Mask */
#define CCT_CAP0_CTRL_FILTER_BYP3(value)      (CCT_CAP0_CTRL_FILTER_BYP3_Msk & (_UINT32_(value) << CCT_CAP0_CTRL_FILTER_BYP3_Pos)) /* Assigment of value for FILTER_BYP3 in the CCT_CAP0_CTRL register */
#define CCT_CAP0_CTRL_FCLK_SEL3_Pos           _UINT32_(29)                                         /* (CCT_CAP0_CTRL) This 3-bit field sets the clock source for the input filter for Capture Register 3. Position */
#define CCT_CAP0_CTRL_FCLK_SEL3_Msk           (_UINT32_(0x7) << CCT_CAP0_CTRL_FCLK_SEL3_Pos)       /* (CCT_CAP0_CTRL) This 3-bit field sets the clock source for the input filter for Capture Register 3. Mask */
#define CCT_CAP0_CTRL_FCLK_SEL3(value)        (CCT_CAP0_CTRL_FCLK_SEL3_Msk & (_UINT32_(value) << CCT_CAP0_CTRL_FCLK_SEL3_Pos)) /* Assigment of value for FCLK_SEL3 in the CCT_CAP0_CTRL register */
#define CCT_CAP0_CTRL_Msk                     _UINT32_(0xE7E7E7E7)                                 /* (CCT_CAP0_CTRL) Register Mask  */


/* -------- CCT_CAP1_CTRL : (CCT Offset: 0x08) (R/W 32) This register is used to configure capture and compare timers 4-5. -------- */
#define CCT_CAP1_CTRL_RESETVALUE              _UINT32_(0x00)                                       /*  (CCT_CAP1_CTRL) This register is used to configure capture and compare timers 4-5.  Reset Value */

