MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cx_sg1/thirdparty/pic32cx_sg1/component/cct.h
#define CCT_CAP1_CTRL_CAP_EDGE4_Pos           _UINT32_(0)                                          /* (CCT_CAP1_CTRL) This field selects the edge type that triggers the capture of the Free Running Counter into Capture Register 4. Position */
#define CCT_CAP1_CTRL_CAP_EDGE4_Msk           (_UINT32_(0x3) << CCT_CAP1_CTRL_CAP_EDGE4_Pos)       /* (CCT_CAP1_CTRL) This field selects the edge type that triggers the capture of the Free Running Counter into Capture Register 4. Mask */
#define CCT_CAP1_CTRL_CAP_EDGE4(value)        (CCT_CAP1_CTRL_CAP_EDGE4_Msk & (_UINT32_(value) << CCT_CAP1_CTRL_CAP_EDGE4_Pos)) /* Assigment of value for CAP_EDGE4 in the CCT_CAP1_CTRL register */
#define CCT_CAP1_CTRL_FILTER_BYP4_Pos         _UINT32_(2)                                          /* (CCT_CAP1_CTRL) This bit enables bypassing the input noise filter for Capture Register 4, so that the input signal goes directly into the timer. Position */
#define CCT_CAP1_CTRL_FILTER_BYP4_Msk         (_UINT32_(0x1) << CCT_CAP1_CTRL_FILTER_BYP4_Pos)     /* (CCT_CAP1_CTRL) This bit enables bypassing the input noise filter for Capture Register 4, so that the input signal goes directly into the timer. Mask */
#define CCT_CAP1_CTRL_FILTER_BYP4(value)      (CCT_CAP1_CTRL_FILTER_BYP4_Msk & (_UINT32_(value) << CCT_CAP1_CTRL_FILTER_BYP4_Pos)) /* Assigment of value for FILTER_BYP4 in the CCT_CAP1_CTRL register */
#define CCT_CAP1_CTRL_FCLK_SEL4_Pos           _UINT32_(5)                                          /* (CCT_CAP1_CTRL) This 3-bit field sets the clock source for the input filter for Capture Register 4. Position */
#define CCT_CAP1_CTRL_FCLK_SEL4_Msk           (_UINT32_(0x7) << CCT_CAP1_CTRL_FCLK_SEL4_Pos)       /* (CCT_CAP1_CTRL) This 3-bit field sets the clock source for the input filter for Capture Register 4. Mask */
#define CCT_CAP1_CTRL_FCLK_SEL4(value)        (CCT_CAP1_CTRL_FCLK_SEL4_Msk & (_UINT32_(value) << CCT_CAP1_CTRL_FCLK_SEL4_Pos)) /* Assigment of value for FCLK_SEL4 in the CCT_CAP1_CTRL register */
#define CCT_CAP1_CTRL_CAP_EDGE5_Pos           _UINT32_(8)                                          /* (CCT_CAP1_CTRL) This field selects the edge type that triggers the capture of the Free Running Counter into Capture Register 5. Position */
#define CCT_CAP1_CTRL_CAP_EDGE5_Msk           (_UINT32_(0x3) << CCT_CAP1_CTRL_CAP_EDGE5_Pos)       /* (CCT_CAP1_CTRL) This field selects the edge type that triggers the capture of the Free Running Counter into Capture Register 5. Mask */
#define CCT_CAP1_CTRL_CAP_EDGE5(value)        (CCT_CAP1_CTRL_CAP_EDGE5_Msk & (_UINT32_(value) << CCT_CAP1_CTRL_CAP_EDGE5_Pos)) /* Assigment of value for CAP_EDGE5 in the CCT_CAP1_CTRL register */
#define CCT_CAP1_CTRL_FILTER_BYP5_Pos         _UINT32_(10)                                         /* (CCT_CAP1_CTRL) This bit enables bypassing the input noise filter for Capture Register 5, so that the input signal goes directly into the timer. Position */
#define CCT_CAP1_CTRL_FILTER_BYP5_Msk         (_UINT32_(0x1) << CCT_CAP1_CTRL_FILTER_BYP5_Pos)     /* (CCT_CAP1_CTRL) This bit enables bypassing the input noise filter for Capture Register 5, so that the input signal goes directly into the timer. Mask */
#define CCT_CAP1_CTRL_FILTER_BYP5(value)      (CCT_CAP1_CTRL_FILTER_BYP5_Msk & (_UINT32_(value) << CCT_CAP1_CTRL_FILTER_BYP5_Pos)) /* Assigment of value for FILTER_BYP5 in the CCT_CAP1_CTRL register */
#define CCT_CAP1_CTRL_FCLK_SEL5_Pos           _UINT32_(13)                                         /* (CCT_CAP1_CTRL) This 3-bit field sets the clock source for the input filter for Capture Register 5. Position */
#define CCT_CAP1_CTRL_FCLK_SEL5_Msk           (_UINT32_(0x7) << CCT_CAP1_CTRL_FCLK_SEL5_Pos)       /* (CCT_CAP1_CTRL) This 3-bit field sets the clock source for the input filter for Capture Register 5. Mask */
#define CCT_CAP1_CTRL_FCLK_SEL5(value)        (CCT_CAP1_CTRL_FCLK_SEL5_Msk & (_UINT32_(value) << CCT_CAP1_CTRL_FCLK_SEL5_Pos)) /* Assigment of value for FCLK_SEL5 in the CCT_CAP1_CTRL register */
#define CCT_CAP1_CTRL_Msk                     _UINT32_(0x0000E7E7)                                 /* (CCT_CAP1_CTRL) Register Mask  */


/* -------- CCT_FREE_RUN : (CCT Offset: 0x0C) (R/W 32) This register contains the current value of the Free Running Timer. -------- */
#define CCT_FREE_RUN_RESETVALUE               _UINT32_(0x00)                                       /*  (CCT_FREE_RUN) This register contains the current value of the Free Running Timer.  Reset Value */

#define CCT_FREE_RUN_TMR_Pos                  _UINT32_(0)                                          /* (CCT_FREE_RUN) This register contains the current value of the Free Running Timer. Position */
#define CCT_FREE_RUN_TMR_Msk                  (_UINT32_(0xFFFFFFFF) << CCT_FREE_RUN_TMR_Pos)       /* (CCT_FREE_RUN) This register contains the current value of the Free Running Timer. Mask */
#define CCT_FREE_RUN_TMR(value)               (CCT_FREE_RUN_TMR_Msk & (_UINT32_(value) << CCT_FREE_RUN_TMR_Pos)) /* Assigment of value for TMR in the CCT_FREE_RUN register */
#define CCT_FREE_RUN_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (CCT_FREE_RUN) Register Mask  */


/* -------- CCT_CAP0 : (CCT Offset: 0x10) (R/W 32) This register saves the value copied from the Free Running timer on a programmed edge of ICT0. -------- */
#define CCT_CAP0_RESETVALUE                   _UINT32_(0x00)                                       /*  (CCT_CAP0) This register saves the value copied from the Free Running timer on a programmed edge of ICT0.  Reset Value */

#define CCT_CAP0_CAP_0_Pos                    _UINT32_(0)                                          /* (CCT_CAP0) This register saves the value copied from the Free Running timer on a programmed edge of ICT0. Position */
#define CCT_CAP0_CAP_0_Msk                    (_UINT32_(0xFFFFFFFF) << CCT_CAP0_CAP_0_Pos)         /* (CCT_CAP0) This register saves the value copied from the Free Running timer on a programmed edge of ICT0. Mask */
#define CCT_CAP0_CAP_0(value)                 (CCT_CAP0_CAP_0_Msk & (_UINT32_(value) << CCT_CAP0_CAP_0_Pos)) /* Assigment of value for CAP_0 in the CCT_CAP0 register */
#define CCT_CAP0_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (CCT_CAP0) Register Mask  */


/* -------- CCT_CAP1 : (CCT Offset: 0x14) (R/W 32) This register saves the value copied from the Free Running timer on a programmed edge of ICT1. -------- */
#define CCT_CAP1_RESETVALUE                   _UINT32_(0x00)                                       /*  (CCT_CAP1) This register saves the value copied from the Free Running timer on a programmed edge of ICT1.  Reset Value */

#define CCT_CAP1_CAP_1_Pos                    _UINT32_(0)                                          /* (CCT_CAP1) This register saves the value copied from the Free Running timer on a programmed edge of ICT1. Position */
#define CCT_CAP1_CAP_1_Msk                    (_UINT32_(0xFFFFFFFF) << CCT_CAP1_CAP_1_Pos)         /* (CCT_CAP1) This register saves the value copied from the Free Running timer on a programmed edge of ICT1. Mask */
#define CCT_CAP1_CAP_1(value)                 (CCT_CAP1_CAP_1_Msk & (_UINT32_(value) << CCT_CAP1_CAP_1_Pos)) /* Assigment of value for CAP_1 in the CCT_CAP1 register */
#define CCT_CAP1_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (CCT_CAP1) Register Mask  */


/* -------- CCT_CAP2 : (CCT Offset: 0x18) (R/W 32) This register saves the value copied from the Free Running timer on a programmed edge of ICT0. -------- */
#define CCT_CAP2_RESETVALUE                   _UINT32_(0x00)                                       /*  (CCT_CAP2) This register saves the value copied from the Free Running timer on a programmed edge of ICT0.  Reset Value */

