MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cx_sg1/thirdparty/pic32cx_sg1/component/cct.h
#define CCT_CAP2_CAP_2_Pos                    _UINT32_(0)                                          /* (CCT_CAP2) This register saves the value copied from the Free Running timer on a programmed edge of ICT2. Position */
#define CCT_CAP2_CAP_2_Msk                    (_UINT32_(0xFFFFFFFF) << CCT_CAP2_CAP_2_Pos)         /* (CCT_CAP2) This register saves the value copied from the Free Running timer on a programmed edge of ICT2. Mask */
#define CCT_CAP2_CAP_2(value)                 (CCT_CAP2_CAP_2_Msk & (_UINT32_(value) << CCT_CAP2_CAP_2_Pos)) /* Assigment of value for CAP_2 in the CCT_CAP2 register */
#define CCT_CAP2_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (CCT_CAP2) Register Mask  */


/* -------- CCT_CAP3 : (CCT Offset: 0x1C) (R/W 32) This register saves the value copied from the Free Running timer on a programmed edge of ICT0. -------- */
#define CCT_CAP3_RESETVALUE                   _UINT32_(0x00)                                       /*  (CCT_CAP3) This register saves the value copied from the Free Running timer on a programmed edge of ICT0.  Reset Value */

#define CCT_CAP3_CAP_3_Pos                    _UINT32_(0)                                          /* (CCT_CAP3) This register saves the value copied from the Free Running timer on a programmed edge of ICT3. Position */
#define CCT_CAP3_CAP_3_Msk                    (_UINT32_(0xFFFFFFFF) << CCT_CAP3_CAP_3_Pos)         /* (CCT_CAP3) This register saves the value copied from the Free Running timer on a programmed edge of ICT3. Mask */
#define CCT_CAP3_CAP_3(value)                 (CCT_CAP3_CAP_3_Msk & (_UINT32_(value) << CCT_CAP3_CAP_3_Pos)) /* Assigment of value for CAP_3 in the CCT_CAP3 register */
#define CCT_CAP3_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (CCT_CAP3) Register Mask  */


/* -------- CCT_CAP4 : (CCT Offset: 0x20) (R/W 32) This register saves the value copied from the Free Running timer on a programmed edge of ICT4. -------- */
#define CCT_CAP4_RESETVALUE                   _UINT32_(0x00)                                       /*  (CCT_CAP4) This register saves the value copied from the Free Running timer on a programmed edge of ICT4.  Reset Value */

#define CCT_CAP4_CAP_4_Pos                    _UINT32_(0)                                          /* (CCT_CAP4) This register saves the value copied from the Free Running timer on a programmed edge of ICT4. Position */
#define CCT_CAP4_CAP_4_Msk                    (_UINT32_(0xFFFFFFFF) << CCT_CAP4_CAP_4_Pos)         /* (CCT_CAP4) This register saves the value copied from the Free Running timer on a programmed edge of ICT4. Mask */
#define CCT_CAP4_CAP_4(value)                 (CCT_CAP4_CAP_4_Msk & (_UINT32_(value) << CCT_CAP4_CAP_4_Pos)) /* Assigment of value for CAP_4 in the CCT_CAP4 register */
#define CCT_CAP4_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (CCT_CAP4) Register Mask  */


/* -------- CCT_CAP5 : (CCT Offset: 0x24) (R/W 32) This register saves the value copied from the Free Running timer on a programmed edge of ICT5. -------- */
#define CCT_CAP5_RESETVALUE                   _UINT32_(0x00)                                       /*  (CCT_CAP5) This register saves the value copied from the Free Running timer on a programmed edge of ICT5.  Reset Value */

#define CCT_CAP5_CAP_5_Pos                    _UINT32_(0)                                          /* (CCT_CAP5) This register saves the value copied from the Free Running timer on a programmed edge of ICT5. Position */
#define CCT_CAP5_CAP_5_Msk                    (_UINT32_(0xFFFFFFFF) << CCT_CAP5_CAP_5_Pos)         /* (CCT_CAP5) This register saves the value copied from the Free Running timer on a programmed edge of ICT5. Mask */
#define CCT_CAP5_CAP_5(value)                 (CCT_CAP5_CAP_5_Msk & (_UINT32_(value) << CCT_CAP5_CAP_5_Pos)) /* Assigment of value for CAP_5 in the CCT_CAP5 register */
#define CCT_CAP5_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (CCT_CAP5) Register Mask  */


/* -------- CCT_COMP0 : (CCT Offset: 0x28) (R/W 32) A COMPARE 0 interrupt is generated when this register matches the value in the Free Running Timer. -------- */
#define CCT_COMP0_RESETVALUE                  _UINT32_(0x00)                                       /*  (CCT_COMP0) A COMPARE 0 interrupt is generated when this register matches the value in the Free Running Timer.  Reset Value */

#define CCT_COMP0_COMP_0_Pos                  _UINT32_(0)                                          /* (CCT_COMP0) A COMPARE 0 interrupt is generated when this register matches the value in the Free Running Timer. Position */
#define CCT_COMP0_COMP_0_Msk                  (_UINT32_(0xFFFFFFFF) << CCT_COMP0_COMP_0_Pos)       /* (CCT_COMP0) A COMPARE 0 interrupt is generated when this register matches the value in the Free Running Timer. Mask */
#define CCT_COMP0_COMP_0(value)               (CCT_COMP0_COMP_0_Msk & (_UINT32_(value) << CCT_COMP0_COMP_0_Pos)) /* Assigment of value for COMP_0 in the CCT_COMP0 register */
#define CCT_COMP0_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (CCT_COMP0) Register Mask  */


/* -------- CCT_COMP1 : (CCT Offset: 0x2C) (R/W 32) A COMPARE 1 interrupt is generated when this register matches the value in the Free Running Timer. -------- */
#define CCT_COMP1_RESETVALUE                  _UINT32_(0x00)                                       /*  (CCT_COMP1) A COMPARE 1 interrupt is generated when this register matches the value in the Free Running Timer.  Reset Value */

#define CCT_COMP1_COMP_1_Pos                  _UINT32_(0)                                          /* (CCT_COMP1) A COMPARE 1 interrupt is generated when this register matches the value in the Free Running Timer. Position */
#define CCT_COMP1_COMP_1_Msk                  (_UINT32_(0xFFFFFFFF) << CCT_COMP1_COMP_1_Pos)       /* (CCT_COMP1) A COMPARE 1 interrupt is generated when this register matches the value in the Free Running Timer. Mask */
#define CCT_COMP1_COMP_1(value)               (CCT_COMP1_COMP_1_Msk & (_UINT32_(value) << CCT_COMP1_COMP_1_Pos)) /* Assigment of value for COMP_1 in the CCT_COMP1 register */
#define CCT_COMP1_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (CCT_COMP1) Register Mask  */


