MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cx_sg1/thirdparty/pic32cx_sg1/component/cct.h
/* -------- CCT_MUX_SEL : (CCT Offset: 0x30) (R/W 32) This register selects the pin mapping to the capture register. -------- */
#define CCT_MUX_SEL_RESETVALUE                _UINT32_(0x543210)                                   /*  (CCT_MUX_SEL) This register selects the pin mapping to the capture register.  Reset Value */

#define CCT_MUX_SEL_CAP0_Pos                  _UINT32_(0)                                          /* (CCT_MUX_SEL) Mux Select for Capture 0 register. Position */
#define CCT_MUX_SEL_CAP0_Msk                  (_UINT32_(0xF) << CCT_MUX_SEL_CAP0_Pos)              /* (CCT_MUX_SEL) Mux Select for Capture 0 register. Mask */
#define CCT_MUX_SEL_CAP0(value)               (CCT_MUX_SEL_CAP0_Msk & (_UINT32_(value) << CCT_MUX_SEL_CAP0_Pos)) /* Assigment of value for CAP0 in the CCT_MUX_SEL register */
#define CCT_MUX_SEL_CAP1_Pos                  _UINT32_(4)                                          /* (CCT_MUX_SEL) Mux Select for Capture 1 register. Position */
#define CCT_MUX_SEL_CAP1_Msk                  (_UINT32_(0xF) << CCT_MUX_SEL_CAP1_Pos)              /* (CCT_MUX_SEL) Mux Select for Capture 1 register. Mask */
#define CCT_MUX_SEL_CAP1(value)               (CCT_MUX_SEL_CAP1_Msk & (_UINT32_(value) << CCT_MUX_SEL_CAP1_Pos)) /* Assigment of value for CAP1 in the CCT_MUX_SEL register */
#define CCT_MUX_SEL_CAP2_Pos                  _UINT32_(8)                                          /* (CCT_MUX_SEL) Mux Select for Capture 2 register. Position */
#define CCT_MUX_SEL_CAP2_Msk                  (_UINT32_(0xF) << CCT_MUX_SEL_CAP2_Pos)              /* (CCT_MUX_SEL) Mux Select for Capture 2 register. Mask */
#define CCT_MUX_SEL_CAP2(value)               (CCT_MUX_SEL_CAP2_Msk & (_UINT32_(value) << CCT_MUX_SEL_CAP2_Pos)) /* Assigment of value for CAP2 in the CCT_MUX_SEL register */
#define CCT_MUX_SEL_CAP3_Pos                  _UINT32_(12)                                         /* (CCT_MUX_SEL) Mux Select for Capture 3 register. Position */
#define CCT_MUX_SEL_CAP3_Msk                  (_UINT32_(0xF) << CCT_MUX_SEL_CAP3_Pos)              /* (CCT_MUX_SEL) Mux Select for Capture 3 register. Mask */
#define CCT_MUX_SEL_CAP3(value)               (CCT_MUX_SEL_CAP3_Msk & (_UINT32_(value) << CCT_MUX_SEL_CAP3_Pos)) /* Assigment of value for CAP3 in the CCT_MUX_SEL register */
#define CCT_MUX_SEL_CAP4_Pos                  _UINT32_(16)                                         /* (CCT_MUX_SEL) Mux Select for Capture 4 register. Position */
#define CCT_MUX_SEL_CAP4_Msk                  (_UINT32_(0xF) << CCT_MUX_SEL_CAP4_Pos)              /* (CCT_MUX_SEL) Mux Select for Capture 4 register. Mask */
#define CCT_MUX_SEL_CAP4(value)               (CCT_MUX_SEL_CAP4_Msk & (_UINT32_(value) << CCT_MUX_SEL_CAP4_Pos)) /* Assigment of value for CAP4 in the CCT_MUX_SEL register */
#define CCT_MUX_SEL_CAP5_Pos                  _UINT32_(20)                                         /* (CCT_MUX_SEL) Mux Select for Capture 5 register. Position */
#define CCT_MUX_SEL_CAP5_Msk                  (_UINT32_(0xF) << CCT_MUX_SEL_CAP5_Pos)              /* (CCT_MUX_SEL) Mux Select for Capture 5 register. Mask */
#define CCT_MUX_SEL_CAP5(value)               (CCT_MUX_SEL_CAP5_Msk & (_UINT32_(value) << CCT_MUX_SEL_CAP5_Pos)) /* Assigment of value for CAP5 in the CCT_MUX_SEL register */
#define CCT_MUX_SEL_Msk                       _UINT32_(0x00FFFFFF)                                 /* (CCT_MUX_SEL) Register Mask  */


/** \brief CCT register offsets definitions */
#define CCT_CTRL_REG_OFST              _UINT32_(0x00)      /* (CCT_CTRL) This register controls the capture and compare timer. Offset */
#define CCT_CAP0_CTRL_REG_OFST         _UINT32_(0x04)      /* (CCT_CAP0_CTRL) This register is used to configure capture and compare timers 0-3. Offset */
#define CCT_CAP1_CTRL_REG_OFST         _UINT32_(0x08)      /* (CCT_CAP1_CTRL) This register is used to configure capture and compare timers 4-5. Offset */
#define CCT_FREE_RUN_REG_OFST          _UINT32_(0x0C)      /* (CCT_FREE_RUN) This register contains the current value of the Free Running Timer. Offset */
#define CCT_CAP0_REG_OFST              _UINT32_(0x10)      /* (CCT_CAP0) This register saves the value copied from the Free Running timer on a programmed edge of ICT0. Offset */
#define CCT_CAP1_REG_OFST              _UINT32_(0x14)      /* (CCT_CAP1) This register saves the value copied from the Free Running timer on a programmed edge of ICT1. Offset */
#define CCT_CAP2_REG_OFST              _UINT32_(0x18)      /* (CCT_CAP2) This register saves the value copied from the Free Running timer on a programmed edge of ICT0. Offset */
#define CCT_CAP3_REG_OFST              _UINT32_(0x1C)      /* (CCT_CAP3) This register saves the value copied from the Free Running timer on a programmed edge of ICT0. Offset */
#define CCT_CAP4_REG_OFST              _UINT32_(0x20)      /* (CCT_CAP4) This register saves the value copied from the Free Running timer on a programmed edge of ICT4. Offset */
#define CCT_CAP5_REG_OFST              _UINT32_(0x24)      /* (CCT_CAP5) This register saves the value copied from the Free Running timer on a programmed edge of ICT5. Offset */
#define CCT_COMP0_REG_OFST             _UINT32_(0x28)      /* (CCT_COMP0) A COMPARE 0 interrupt is generated when this register matches the value in the Free Running Timer. Offset */
#define CCT_COMP1_REG_OFST             _UINT32_(0x2C)      /* (CCT_COMP1) A COMPARE 1 interrupt is generated when this register matches the value in the Free Running Timer. Offset */
#define CCT_MUX_SEL_REG_OFST           _UINT32_(0x30)      /* (CCT_MUX_SEL) This register selects the pin mapping to the capture register. Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief CCT register API structure */
typedef struct
{  /* This is a 16-bit auto-reloading timer/counter. */
  __IO  uint32_t                       CCT_CTRL;           /**< Offset: 0x00 (R/W  32) This register controls the capture and compare timer. */
  __IO  uint32_t                       CCT_CAP0_CTRL;      /**< Offset: 0x04 (R/W  32) This register is used to configure capture and compare timers 0-3. */
  __IO  uint32_t                       CCT_CAP1_CTRL;      /**< Offset: 0x08 (R/W  32) This register is used to configure capture and compare timers 4-5. */
  __IO  uint32_t                       CCT_FREE_RUN;       /**< Offset: 0x0C (R/W  32) This register contains the current value of the Free Running Timer. */
  __IO  uint32_t                       CCT_CAP0;           /**< Offset: 0x10 (R/W  32) This register saves the value copied from the Free Running timer on a programmed edge of ICT0. */
  __IO  uint32_t                       CCT_CAP1;           /**< Offset: 0x14 (R/W  32) This register saves the value copied from the Free Running timer on a programmed edge of ICT1. */
  __IO  uint32_t                       CCT_CAP2;           /**< Offset: 0x18 (R/W  32) This register saves the value copied from the Free Running timer on a programmed edge of ICT0. */
  __IO  uint32_t                       CCT_CAP3;           /**< Offset: 0x1C (R/W  32) This register saves the value copied from the Free Running timer on a programmed edge of ICT0. */
  __IO  uint32_t                       CCT_CAP4;           /**< Offset: 0x20 (R/W  32) This register saves the value copied from the Free Running timer on a programmed edge of ICT4. */
  __IO  uint32_t                       CCT_CAP5;           /**< Offset: 0x24 (R/W  32) This register saves the value copied from the Free Running timer on a programmed edge of ICT5. */
  __IO  uint32_t                       CCT_COMP0;          /**< Offset: 0x28 (R/W  32) A COMPARE 0 interrupt is generated when this register matches the value in the Free Running Timer. */
  __IO  uint32_t                       CCT_COMP1;          /**< Offset: 0x2C (R/W  32) A COMPARE 1 interrupt is generated when this register matches the value in the Free Running Timer. */
  __IO  uint32_t                       CCT_MUX_SEL;        /**< Offset: 0x30 (R/W  32) This register selects the pin mapping to the capture register. */
} cct_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _0525SG12_CCT_COMPONENT_H_ */
